# SpecifySlopeOrOffset Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..SpecifySlopeOrOffset Property
ParameterTypeId Class See Also
---
"Specify "
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId SpecifySlopeOrOffset { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpecifySlopeOrOffset As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SpecifySlopeOrOffset {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace